{
   "class_name": "Model", 
   "keras_version": "1.2.2", 
   "config": {
      "layers": [
         {
            "class_name": "InputLayer", 
            "inbound_nodes": [], 
            "config": {
               "batch_input_shape": [
                  null, 
                  128, 
                  128, 
                  64, 
                  1
               ], 
               "sparse": false, 
               "input_dtype": "float32", 
               "name": "input_1"
            }, 
            "name": "input_1"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "input_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_1", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 16, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_1"
         }, 
         {
            "class_name": "MaxPooling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "name": "maxpooling3d_1", 
               "trainable": true, 
               "dim_ordering": "tf", 
               "pool_size": [
                  2, 
                  2, 
                  2
               ], 
               "strides": [
                  2, 
                  2, 
                  2
               ], 
               "border_mode": "valid"
            }, 
            "name": "maxpooling3d_1"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "maxpooling3d_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_2", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 32, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_2"
         }, 
         {
            "class_name": "MaxPooling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_2", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "name": "maxpooling3d_2", 
               "trainable": true, 
               "dim_ordering": "tf", 
               "pool_size": [
                  2, 
                  2, 
                  2
               ], 
               "strides": [
                  2, 
                  2, 
                  2
               ], 
               "border_mode": "valid"
            }, 
            "name": "maxpooling3d_2"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "maxpooling3d_2", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_3", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 64, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_3"
         }, 
         {
            "class_name": "MaxPooling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_3", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "name": "maxpooling3d_3", 
               "trainable": true, 
               "dim_ordering": "tf", 
               "pool_size": [
                  2, 
                  2, 
                  2
               ], 
               "strides": [
                  2, 
                  2, 
                  2
               ], 
               "border_mode": "valid"
            }, 
            "name": "maxpooling3d_3"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "maxpooling3d_3", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_4", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 128, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_4"
         }, 
         {
            "class_name": "MaxPooling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_4", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "name": "maxpooling3d_4", 
               "trainable": true, 
               "dim_ordering": "tf", 
               "pool_size": [
                  2, 
                  2, 
                  2
               ], 
               "strides": [
                  2, 
                  2, 
                  2
               ], 
               "border_mode": "valid"
            }, 
            "name": "maxpooling3d_4"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "maxpooling3d_4", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_5", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 128, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_5"
         }, 
         {
            "class_name": "UpSampling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_5", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "name": "upsampling3d_1", 
               "size": [
                  2, 
                  2, 
                  2
               ]
            }, 
            "name": "upsampling3d_1"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "upsampling3d_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_6", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 64, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_6"
         }, 
         {
            "class_name": "UpSampling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_6", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "name": "upsampling3d_2", 
               "size": [
                  2, 
                  2, 
                  2
               ]
            }, 
            "name": "upsampling3d_2"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "upsampling3d_2", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_7", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 32, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_7"
         }, 
         {
            "class_name": "UpSampling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_7", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "name": "upsampling3d_3", 
               "size": [
                  2, 
                  2, 
                  2
               ]
            }, 
            "name": "upsampling3d_3"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "upsampling3d_3", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_8", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 16, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_8"
         }, 
         {
            "class_name": "UpSampling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_8", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "name": "upsampling3d_4", 
               "size": [
                  2, 
                  2, 
                  2
               ]
            }, 
            "name": "upsampling3d_4"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "upsampling3d_4", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_9", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "linear", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "tf", 
               "kernel_dim3": 1, 
               "kernel_dim2": 1, 
               "kernel_dim1": 1, 
               "bias": true, 
               "nb_filter": 2, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "valid"
            }, 
            "name": "convolution3d_9"
         }, 
         {
            "class_name": "Reshape", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_9", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "target_shape": [
                  1048576, 
                  2
               ], 
               "trainable": true, 
               "name": "reshape_1"
            }, 
            "name": "reshape_1"
         }, 
         {
            "class_name": "Activation", 
            "inbound_nodes": [
               [
                  [
                     "reshape_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "activation": "softmax", 
               "trainable": true, 
               "name": "activation_1"
            }, 
            "name": "activation_1"
         }
      ], 
      "input_layers": [
         [
            "input_1", 
            0, 
            0
         ]
      ], 
      "name": "model_2", 
      "output_layers": [
         [
            "activation_1", 
            0, 
            0
         ]
      ]
   }
}